nodejs/logs/express-pm2/test2.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /
Document Length:        65 bytes

Concurrency Level:      100
Time taken for tests:   6.776 seconds
Complete requests:      10000
Failed requests:        1024
Total transferred:      2718865 bytes
HTML transferred:       648865 bytes
Requests per second:    1475.73 [#/sec] (mean)
Time per request:       67.763 [ms] (mean)
Time per request:       0.678 [ms] (mean, across all concurrent requests)
Transfer rate:          391.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       6
Processing:     7   67   7.0     67     125
Waiting:        3   67   6.9     66     124
Total:          9   67   6.8     67     125

Percentage of the requests served within a certain time (ms)
  50%     67
  66%     69
  75%     70
  80%     71
  90%     74
  95%     78
  98%     85
  99%     88
 100%    125 (longest request)